Revit 2024 API
ScheduleField.HorizontalAlignment Property
 The horizontal alignment of the column's data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ScheduleHorizontalAlignment HorizontalAlignment { get; set; }
Visual Basic
Public Property HorizontalAlignment As ScheduleHorizontalAlignment
	Get
	Set
Visual C++
public:
property ScheduleHorizontalAlignment HorizontalAlignment {
	ScheduleHorizontalAlignment get ();
	void set (ScheduleHorizontalAlignment value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ScheduleField Class
Autodesk.Revit.DB Namespace